#ifndef COMMON_DATA_H
#define COMMON_DATA_H

#include <types.h>

typedef struct {
    /* 0x0 */ const char* adxFile;
    /* 0x4 */ s32         unk_04;
} UnkStruct_0205e0f4;
extern UnkStruct_0205e0f4 data_0205e0f4[70];

typedef struct {
    s32 unk_00;
    s32 unk_04;
    s32 unk_08;
    s32 unk_0C;
    s32 unk_10;
    s32 unk_14;
    s32 unk_18;
    s32 unk_1C;
    s32 unk_20;
    s32 unk_24;
    s32 unk_28;
    s32 unk_2C;
    s32 unk_30;
    s32 unk_34;
    s32 unk_38;
    s32 unk_3C;
    s32 unk_40;
    s32 unk_44;
    s32 unk_48;
    s32 unk_4C;
    s32 unk_50;
    s32 unk_54;
    s32 unk_58;
    s32 unk_5C;
    s32 unk_60;
} UnkStruct_0206aa80;
extern UnkStruct_0206aa80 data_0206aa80;

typedef struct {
    /* 0x0 */ s32 unk_00;
    /* 0x4 */ s32 unk_04;
} UnkStruct_0206b3cc;
extern UnkStruct_0206b3cc data_0206b3cc;

typedef struct {
    /* 0x0 */ u16 unk_00;
    /* 0x2 */ u16 unk_02;
    /* 0x4 */ u16 unk_04;
} UnkStruct_02066a24;
extern UnkStruct_02066a24 data_02066a24;

typedef struct {
    /* 0x00 */ s32   unk_00;
    /* 0x04 */ s32   unk_04;
    /* 0x08 */ s32   unk_08;
    /* 0x0C */ s32   unk_0C;
    /* 0x10 */ s32   unk_10;
    /* 0x14 */ void* unk_14;
    /* 0x18 */ s16   unk_18;
    /* 0x18 */ s16   unk_1A;
    /* 0x1C */ u16   unk_1C;
    /* 0x1E */ u16   unk_1E;
} UnkStruct_usedby_02025b68;
extern UnkStruct_usedby_02025b68 usedby_02025b68;

typedef struct {
    /* 0x0 */ s8  unk_00;
    /* 0x1 */ s8  unk_01;
    /* 0x2 */ s16 unk_02;
} UnkStruct_0205cb3c;
extern UnkStruct_0205cb3c data_0205cb3c[1388];

typedef struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
} UnkStruct_0206ab20;
extern UnkStruct_0206ab20 data_0206ab20;

typedef struct {
    /* 0x00 */ s32 unk_00;
    /* 0x04 */ s32 unk_04;
    /* 0x08 */ s32 unk_08;
    /* 0x0C */ s32 unk_0C;
    /* 0x10 */ s32 unk_10;
    /* 0x14 */ s32 unk_14;
    /* 0x18 */ s32 unk_18;
    /* 0x1C */ s32 unk_1C;
    /* 0x20 */ s32 unk_20;
    /* 0x24 */ s32 unk_24;
    /* 0x28 */ s32 unk_28;
    /* 0x2C */ s32 unk_2C;
    /* 0x30 */ s32 unk_30;
    /* 0x34 */ s32 unk_34;
    /* 0x38 */ s32 unk_38;
    /* 0x3C */ s32 unk_3C;
    /* 0x40 */ s32 unk_40;
    /* 0x44 */ s32 unk_44;
    /* 0x48 */ s32 unk_48;
    /* 0x4C */ s32 unk_4C;
    /* 0x50 */ s32 unk_50;
    /* 0x54 */ s32 unk_54;
    /* 0x58 */ s32 unk_58;
    /* 0x5C */ s32 unk_5C;
    /* 0x60 */ s32 unk_60;
    /* 0x64 */ s32 unk_64;
    /* 0x68 */ s32 unk_68;
    /* 0x6C */ s32 unk_6C;
    /* 0x70 */ s32 unk_70;
    /* 0x74 */ s32 unk_74;
    /* 0x78 */ char unk_78[0x34];
    /* 0xAC */ s32 unk_AC;
    /* 0xB0 */ s32 unk_B0;
    /* 0xB4 */ char unk_B4[0x34];
    /* 0xE8 */ s32 unk_E8;
    /* 0xEC */ s32 unk_EC;
} UnkStruct_0206ad04;
extern UnkStruct_0206ad04 data_0206ad04;

extern s32 data_0205c9b0;

extern s32 data_0206a9b0;
extern s32 data_0206770c;
extern s32 data_02068798;
extern s16 data_02066aec;
extern s32 data_02066a20;
extern s32 data_02066cec;
extern s16 data_02066eec;
extern s32 data_020670ec;
extern s32 data_020676ec;
extern s32 data_02068778;

extern s32 data_02069804;
extern s32 data_0206ab18;
extern s32 data_0206ab54;
extern s32 DAT_0206ab90;
extern s32 DAT_0206abcc;
extern s32 DAT_0206ab1c;
extern s32 DAT_0206ab58;
extern s32 DAT_0206ab94;
extern s32 DAT_0206abd0;
extern s32 data_0206aa78;
extern s32 data_0206aa7c;
extern s32 data_0206ad08;
extern s32 DAT_0206ad20;
extern s32 data_0206ad24;
extern s32 data_0206ad2c;
extern s32 DAT_0206ad30;
extern s32 DAT_0206ad38;
extern s32 DAT_0206ad74;
extern s32 DAT_0206adb0;
extern s32 DAT_0206adec;
extern s32 DAT_0206ad3c;
extern s32 DAT_0206ad78;
extern s32 DAT_0206adb4;
extern s32 DAT_0206adf0;
extern s32 data_0206acec;
extern s32 data_0206acf0;
extern s32 data_0206acf4;
extern s32 data_0206acf8;
extern s32 data_0206acfc;
extern s32 data_0205e0f0;

#endif // COMMON_DATA_H